```python
# cruid
# C: create database
# R: read
# U: update
# I: insert
# D: delete
```

In [1]:
import sqlite3

In [2]:
con = sqlite3.connect('class1.db')

In [3]:
con.cursor()

In [4]:
cur = con.cursor()

# create syntax in SQL

In [5]:
query = '''
create table class1(rollno int,
name varchar(50)
)
'''

In [6]:
con.execute(query)

OperationalError: table class1 already exists

In [ ]:
con.commit()

# insert statement in SQL

In [7]:
insert_query = """
insert into class1
(rollno, name)values
(1, 'prajay'),
(2, 'BIshow'),
(3, 'upama'),
(4, 'krishna')
"""

In [8]:
con.execute(insert_query)

In [9]:
con.commit()

# select statement in SQL
```sql
#Â select * from table_name
```

In [10]:
read_query = 'select * from {}'.format('class1')

In [11]:
read_query

'select * from class1'

In [12]:
con.execute(read_query).fetchall()

[(1, 'prajay'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna')]

In [13]:
q = '''
select * from class1 where rollno = 2
'''
con.execute(q).fetchall()

[(2, 'BIshow'), (2, 'BIshow'), (2, 'BIshow'), (2, 'BIshow'), (2, 'BIshow')]

# update statement in SQL

In [14]:
up_query = """
update class1
set name = 'prajay kc'
where
rollno = 1
"""

In [15]:
cur.execute(up_query)

In [16]:
con.commit()

In [17]:
cur.execute("select * from class1").fetchall()

[(1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna')]

# executemany

In [18]:
data = [
    (5, "apurba Dhakal"),
    (6, "Swatika yogi")
]

In [19]:
con.executemany('Insert Into class1(rollno,name)values(?,?)',data)

In [20]:
con.execute("select * from class1").fetchall()

[(1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (5, 'apurba Dhakal'),
 (6, 'Swatika yogi')]

In [23]:
# DELETE from table where condition;

In [24]:
con.execute('DELETE from class1 where rollno = 6')

In [25]:
con.execute("select * from class1").fetchall()

[(1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (1, 'prajay kc'),
 (2, 'BIshow'),
 (3, 'upama'),
 (4, 'krishna'),
 (5, 'apurba Dhakal')]